<p>Жил на свете сапожник. Денег у него совсем не было. И так он наконец обеднел, что остался у него всего только один кусок кожи на пару сапог. Выкроил под вечер он из этой кожи заготовки для сапог и подумал: «Лягу я спать, а утром встану пораньше и сошью сапоги». Так он и сделал: лёг и уснул. А утром проснулся, умылся и хотел сесть за работу.

Только смотрит, а сапоги уже сшиты.

Очень удивился сапожник. Взял он сапоги и стал их внимательно рассматривать.

Как хорошо были они сработаны! Ни одного стежка не было неверного. Сразу было видно, что искусный мастер те сапоги шил. А скоро нашёлся и покупатель на сапоги.

И так они ему понравились, что заплатил он за них большие деньги. Смог теперь сапожник купить себе кожи на две пары сапог.

Скроил он вечером две пары и думает: «Лягу я сейчас спать, а утром встану пораньше и начну шить».

Встал он утром, умылся, смотрит — готовы обе пары сапог.

Покупатели опять скоро нашлись. Очень им понравились сапоги. Заплатили они сапожнику большие деньги, и смог он купить себе кожи на целых четыре пары сапог.

На другое утро и эти четыре пары были готовы.

И так пошло с тех пор каждый день. Что скроит вечером сапожник, то к утру уже бывает сшито.

Кончилась у сапожника бедная да голодная жизнь.

Однажды вечером скроил он, как всегда, сапоги, но перед сном вдруг говорит своей жене:

— Слушай, жена, что если сегодня ночью не ложиться спать, а посмотреть, кто это нам сапоги шьёт?

Жена обрадовалась и сказала:

— Конечно, не будем ложиться, давай посмотрим.

Зажгла жена свечку на столе, потом спрятались они в углу под платьями и стали ждать.

И вот ровно в полночь пришли в комнату маленькие человечки. Сели они за сапожный стол, взяли своими маленькими пальчиками накроенную кожу и принялись шить.

Они так проворно и быстро тыкали шилом, тачали да постукивали молотками, что сапожник от изумления не мог отвести от них глаз.

Они работали до тех пор, пока не сшили все сапоги. А когда последняя пара была готова, спрыгнули человечки со стола и сразу исчезли.

Утром жена сказала мужу:

— Маленькие человечки сделали нас богатыми. Надо и нам сделать для них что-нибудь хорошее. Приходят человечки к нам по ночам, одежды на них нет, и, наверно, им очень холодно. Знаешь, что я придумала: сошью-ка я каждому из них курточку, рубашечку и штанишки. А ты им сапожки смастери.

Выслушал её муж и говорит:

— Хорошо ты придумала. То-то они, верно, обрадуются!

И вот однажды вечером положили они свои подарки на стол вместо выкроенной кожи, а сами опять спрятались в углу и стали ждать маленьких человечков.

Ровно в полночь, как всегда, пришли в комнату маленькие человечки. Они прыгнули на стол и хотели сразу же приняться за работу. Только смотрят — на столе вместо скроенной кожи лежат красные рубашечки, костюмчики и стоят маленькие сапожки.

Сперва удивились маленькие человечки, а потом очень обрадовались. Быстро-быстро надели они свои красивые костюмчики и сапожки, затанцевали и запели:

Хороши у нас наряды,
Значит, не о чем тужить!
Мы нарядам нашим рады
И сапог не будем шить!

Долго пели, танцевали и прыгали маленькие человечки через стулья и скамейки. Потом они исчезли и больше уже не приходили шить сапоги. Но счастье и удача с тех пор не покидали сапожника во всю его долгую жизнь.</p>